fio/outputs/testext2orig/fio-seq-read.output
file1: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=16
fio-3.12
Starting 1 process
file1: Laying out IO file (1 file / 10240MiB)

file1: (groupid=0, jobs=1): err= 0: pid=1778: Mon Jul 27 21:15:44 2020
  read: IOPS=2118, BW=530MiB/s (555MB/s)(466GiB/900008msec)
    slat (usec): min=4, max=17184, avg=18.14, stdev=13.37
    clat (usec): min=537, max=49712, avg=7531.32, stdev=1286.67
     lat (usec): min=560, max=49723, avg=7549.89, stdev=1286.80
    clat percentiles (usec):
     |  1.00th=[ 6980],  5.00th=[ 7373], 10.00th=[ 7373], 20.00th=[ 7373],
     | 30.00th=[ 7439], 40.00th=[ 7439], 50.00th=[ 7439], 60.00th=[ 7439],
     | 70.00th=[ 7504], 80.00th=[ 7504], 90.00th=[ 7570], 95.00th=[ 7570],
     | 99.00th=[ 7767], 99.50th=[20055], 99.90th=[23725], 99.95th=[24249],
     | 99.99th=[38011]
   bw (  KiB/s): min=498176, max=552960, per=99.99%, avg=542372.12, stdev=6829.74, samples=1800
   iops        : min= 1946, max= 2160, avg=2118.61, stdev=26.68, samples=1800
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.07%, 4=0.20%, 10=98.94%, 20=0.28%, 50=0.50%
  cpu          : usr=0.70%, sys=4.85%, ctx=1671532, majf=0, minf=524
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1906951,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=530MiB/s (555MB/s), 530MiB/s-530MiB/s (555MB/s-555MB/s), io=466GiB (500GB), run=900008-900008msec

Disk stats (read/write):
  sda: ios=2034844/1, merge=65/0, ticks=15271794/7, in_queue=15265332, util=100.00%