fio/outputs/testext2orig/fio-seq-write.output
file1: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=16
fio-3.12
Starting 1 process
file1: Laying out IO file (1 file / 10240MiB)

file1: (groupid=0, jobs=1): err= 0: pid=1799: Mon Jul 27 21:30:45 2020
  write: IOPS=1899, BW=475MiB/s (498MB/s)(417GiB/900004msec); 0 zone resets
    slat (usec): min=62, max=80218, avg=383.00, stdev=1803.72
    clat (usec): min=3, max=5943.6k, avg=7896.42, stdev=111943.85
     lat (usec): min=1080, max=5943.7k, avg=8279.75, stdev=111949.35
    clat percentiles (usec):
     |  1.00th=[   1045],  5.00th=[   1057], 10.00th=[   1074],
     | 20.00th=[   1123], 30.00th=[   1385], 40.00th=[   1565],
     | 50.00th=[   1680], 60.00th=[   2245], 70.00th=[  10552],
     | 80.00th=[  12256], 90.00th=[  14222], 95.00th=[  14615],
     | 99.00th=[  15664], 99.50th=[  16319], 99.90th=[  21365],
     | 99.95th=[  61604], 99.99th=[5939135]
   bw (  KiB/s): min=11776, max=3563520, per=100.00%, avg=645535.18, stdev=519102.92, samples=1356
   iops        : min=   46, max=13920, avg=2521.62, stdev=2027.76, samples=1356
  lat (usec)   : 4=0.01%
  lat (msec)   : 2=58.62%, 4=2.71%, 10=1.78%, 20=36.78%, 50=0.03%
  lat (msec)   : 100=0.04%
  cpu          : usr=0.82%, sys=21.99%, ctx=395892, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1709773,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=475MiB/s (498MB/s), 475MiB/s-475MiB/s (498MB/s-498MB/s), io=417GiB (448GB), run=900004-900004msec

Disk stats (read/write):
  sda: ios=84/867000, merge=0/21689, ticks=3225/48860182, in_queue=47699296, util=95.28%